



PCP Working Group                                           M. Boucadair
Internet-Draft                                            France Telecom
Intended status: Standards Track                                R. Penno
Expires: September 12, 2013                                      D. Wing
                                                                   Cisco
                                                          March 11, 2013


                         PCP Description Option
                  draft-ietf-pcp-description-option-00

Abstract

   This document extends Port Control Protocol (PCP) with the ability to
   associate a description with a PCP-instantiated mapping: DESCRIPTION
   Option.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on September 12, 2013.

Copyright Notice

   Copyright (c) 2013 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of



Boucadair, et al.      Expires September 12, 2013               [Page 1]

Internet-Draft           PCP Description Option               March 2013


   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Format  . . . . . . . . . . . . . . . . . . . . . . . . . . .   2
   3.  Behaviour . . . . . . . . . . . . . . . . . . . . . . . . . .   3
   4.  Security Considerations . . . . . . . . . . . . . . . . . . .   4
   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4
   6.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   4
     6.1.  Normative References  . . . . . . . . . . . . . . . . . .   4
     6.2.  Informative References  . . . . . . . . . . . . . . . . .   5
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   5

1.  Introduction

   This document extends the base PCP [I-D.ietf-pcp-base] with the
   ability to associate a description with a PCP-instantiated mapping:
   DESCRIPTION Option.

   This option can be used in the context of
   [I-D.ietf-pcp-upnp-igd-interworking].

2.  Format

   The format of DESCRIPTION Option is shown in Figure 1.

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | DESCRIPTION   |  Reserved     |           Length              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                           Description                         |
      :                                                               :
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

        This Option:

         Option Name: Description Option (DESCRIPTION)
         Number: TBA in the optional-to-process range (IANA)
         Purpose: Used to associate a text description with a mapping
         Valid for Opcodes: MAP, PEER
         Length: Variable



Boucadair, et al.      Expires September 12, 2013               [Page 2]

Internet-Draft           PCP Description Option               March 2013


         May appear in: both request and response
         Maximum occurrences: 1


                       Figure 1: Description Option

   Description field MUST carry UTF-8 encoded [RFC3629] description
   text.  The description text SHOULD NOT be null terminated.

   This option can be used by a user (or an application) to indicate a
   description associated with a given mapping such as "FTP server", "My
   remote access to my CP router", "Camera", "Network attached storage
   serve", etc.

   Issues related to the usage of this field for troubleshooting or for
   any further usage are out of scope of this document.

3.  Behaviour

   DESCRIPTION Option is optional to be supported by PCP Servers and PCP
   Clients.

   This option (Code TBA, Figure 1) MAY be included in a PCP MAP/PEER
   request to associate a description with the requested mapping.

   The PCP Server MAY be configurable to accept the DESCRIPTION Option.
   If the PCP Server does not support the DESCRIPTION Option or it is
   configured to ignore it, received DESCRIPTION Options MUST be ignored
   by the PCP Server and no DESCRIPTION Option MUST be included in the
   response.  The PCP Server MUST store the content of DESCRIPTION
   Option only if it supports the DESCRIPTION Option and if it is
   configured to accept handling DESCRIPTION Options it receives.

   If the PCP Client does not receive a DESCRIPTION Option in a response
   to a request enclosing a DESCRIPTION Option, this means the PCP
   Server does not support that Option.  The PCP Client SHOULD avoid
   including the DESCRIPTION Option in any subsequent request to that
   PCP Server.

   If the DESCRIPTION Option is not included in the request, the PCP
   Server MUST NOT include the DESCRIPTION Option in the associated
   response.

   The PCP Client MUST NOT include empty DESCRIPTION Option (i.e.,
   Length set to 0) in a request.  Empty DESCRIPTION Options MUST be
   ignored by the PCP Server.





Boucadair, et al.      Expires September 12, 2013               [Page 3]

Internet-Draft           PCP Description Option               March 2013


   The maximum length SHOULD be configurable in the PCP Server.  If a
   PCP Client includes a DESCRIPTION PCP Option with a length exceeding
   the maximum length supported by the PCP Server, only the portion of
   the Description field fitting that maximum length is stored by the
   PCP Server and returned to the PCP Client in the response.

   If the PCP Server receives a DESCRIPTION Option having a length which
   does not exceed the maximum value configured, the PCP Server MUST
   record the complete sequence of the description text and MUST send
   back to the PCP Client the same DESCRIPTION Option as the one
   included in the request.  If the description text carried in the
   DESCRIPTION Option is null terminated, the exact description text,
   including Null characters, MUST be returned by the PCP Server.

4.  Security Considerations

   Security considerations discussed in [I-D.ietf-pcp-base] must be
   considered.  In addition, administrators of PCP Servers SHOULD
   configure a maximum description length which does not lead to exhaust
   storage resources in the PCP Server.

   Within this document, the content of DESCRIPTION Option is not used
   as a hint to construct a mapping in the PCP Server.  If future
   documents make use of this option to influence the PCP Server
   decisions, those document MUST elaborate on the associated security
   considerations.

5.  IANA Considerations

   The following PCP Option Codes are to be allocated in the optional-
   to-process range:

      DESCRIPTION

6.  References

6.1.  Normative References

   [I-D.ietf-pcp-base]
              Wing, D., Cheshire, S., Boucadair, M., Penno, R., and P.
              Selkirk, "Port Control Protocol (PCP)", draft-ietf-pcp-
              base-29 (work in progress), November 2012.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3629]  Yergeau, F., "UTF-8, a transformation format of ISO
              10646", STD 63, RFC 3629, November 2003.



Boucadair, et al.      Expires September 12, 2013               [Page 4]

Internet-Draft           PCP Description Option               March 2013


6.2.  Informative References

   [I-D.ietf-pcp-upnp-igd-interworking]
              Boucadair, M., Penno, R., and D. Wing, "Universal Plug and
              Play (UPnP) Internet Gateway Device (IGD)-Port Control
              Protocol (PCP) Interworking Function", draft-ietf-pcp-
              upnp-igd-interworking-06 (work in progress), December
              2012.

Authors' Addresses

   Mohamed Boucadair
   France Telecom
   Rennes  35000
   France

   Email: mohamed.boucadair@orange.com


   Reinaldo Penno
   Cisco
   USA

   Email: repenno@cisco.com


   Dan Wing
   Cisco Systems, Inc.
   170 West Tasman Drive
   San Jose, California  95134
   USA

   Email: dwing@cisco.com

















Boucadair, et al.      Expires September 12, 2013               [Page 5]
